# Текст у форматі json - це такий самий текст як і будь-який інший.
# Форматування робить його зручнм щоб витягувати з нього будь-які його частини.
# Працюючи з текстом як зі строкою, важко звернутись до конкретного поля, бо в ній немає пари "ключ":"значення".
# І щоб це можна було зробити, то ми повинні перетворити цю строку в об"єкт,
# тоді ми розберемо цей об"єкт і вже з нього будемо витягувати потрібні нам значення.
# Parsing означає "розбір"б "розбирати".

import json

string_as_json_format = '{"answer": "Hello, User"}'      # змінна типу string, так виглядає json-формат ДО парсінгу
obj = json.loads(string_as_json_format)      # строка перетворюється в об"єкт, що нагадує по своїх властивостях словник
print(obj)   # {dict: 1} {'answer':'Hello, User}
print(obj['answer'])  # звертаємось до ключа "answer" у словнику obj і повертаємо/друкуємо його значення:
# Hello, User

# якщо ми звернемось до ключа, якого немає, то отримаємо т.зв. key-error.
# тому перед тим, як використовувати будь-який ключ, потрібно перевіряти його наявність
key = "answer2"
if key in obj:
    print(obj[key])     # print(obj['answer2'])
else:
    print(f"Ключа {key} в JSON немає")
# Ключа "answer2" в JSON немає

key = "answer"
if key in obj:
    print(obj[key])     # print(obj['answer'])
else:
    print(f"Ключа {key} в JSON немає")
# Hello, User
